Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.RoomGeometryCannotFindFreeFacesBoundingElement Property
 An error occurred while trying to find the free part of a face of the bounding geometry for [Room] when processing the room-bounding element [Name]. The free part of the face is found by subtracting the portions of the face that overlap various room-bounding element faces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomGeometryCannotFindFreeFacesBoundingElement { get; }
Public Shared ReadOnly Property RoomGeometryCannotFindFreeFacesBoundingElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomGeometryCannotFindFreeFacesBoundingElement {
	FailureDefinitionId^ get ();
}
static member RoomGeometryCannotFindFreeFacesBoundingElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace